perf/scenarios/stress-test.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-stress"

  pool: 200 # Más conexiones concurrentes

  phases:
    - name: Warm-up
      duration: 60
      arrivalRate: 5
      rampTo: 20
    - name: Ramp to High Load
      duration: 120
      arrivalRate: 20
      rampTo: 50
    - name: Sustained High Load
      duration: 180
      arrivalRate: 50
    - name: Peak Stress
      duration: 60
      arrivalRate: 100
    - name: Spike Test
      duration: 30
      arrivalRate: 150
    - name: Recovery
      duration: 60
      arrivalRate: 10

scenarios:
  - name: Heavy Exchange Operations
    weight: 60
    flow:
      - get:
          url: '/rates'
      - post:
          url: '/exchange'
          json:
            baseCurrency: '{{ $pick(["USD", "EUR", "BRL"]) }}'
            counterCurrency: '{{ $pick(["ARS"]) }}'
            baseAmount: '{{ $randomFloat(100, 5000) }}'
            baseAccountId: '{{ $randomInt(1, 4) }}'
            counterAccountId: '{{ $randomInt(1, 4) }}'
          expect:
            - statusCode: [200, 400, 500]
      - post:
          url: '/exchange'
          json:
            baseCurrency: 'ARS'
            counterCurrency: 'USD'
            baseAmount: '{{ $randomFloat(10000, 100000) }}'
            baseAccountId: '{{ $randomInt(1, 4) }}'
            counterAccountId: '{{ $randomInt(1, 4) }}'
          expect:
            - statusCode: [200, 400, 500]

  - name: Rate Management Stress
    weight: 25
    flow:
      - get:
          url: '/rates'
      - put:
          url: '/rates'
          json:
            baseCurrency: 'USD'
            counterCurrency: 'ARS'
            rate: '{{ $randomFloat(1400, 1600) }}'
      - put:
          url: '/rates'
          json:
            baseCurrency: 'EUR'
            counterCurrency: 'ARS'
            rate: '{{ $randomFloat(1700, 1900) }}'
      - get:
          url: '/rates'

  - name: Account Operations Stress
    weight: 15
    flow:
      - get:
          url: '/accounts'
      - put:
          url: '/accounts/1/balance'
          json:
            balance: '{{ $randomInt(100000000, 500000000) }}'
      - put:
          url: '/accounts/2/balance'
          json:
            balance: '{{ $randomInt(50000, 200000) }}'
      - get:
          url: '/accounts'
      - get:
          url: '/log'